import React from 'react';
import { Container } from 'react-bootstrap';
import { useLocation, useNavigate } from 'react-router-dom';

const Care = () => {
  const location = useLocation();
  const navigate = useNavigate();
  const backLink = location.state?.from ?? '/';
  const handleBackClick = () => navigate(backLink);
  return (
    <main>
      <div>
        <div className="intro intro-care">
        <button
          className="btn-back"
          type="button"
          onClick={handleBackClick}
        >
          <i className="fa fa-arrow-left-long mr-2"></i>
        </button>
          </div>
      <Container>
        <h2>Догляд - Льон</h2>
        <h4>
          Вироби VITRYLO із льону будуть слугувати вам довго, але слід
          дотримуватись простих правил.
        </h4>
        <h5 className="mt-4">Прання</h5>
        <p>
          Прати білі та кольорові речі слід роздільно. Тканина і барвники
          натурального походження, тому можуть бути схильними до «кольорового
          обміну» в процесі прання. Білі речі слід прати при температурі 40
          градусів, кольорові – при 30. В обох випадках допускається тільки
          повільний режим центрифуги (віджиму). Слід використовувати пральні
          засоби, які не містять хлору. Допускається використання кондиціонерів.
          Не віджимати на високих обертах та не сушити у пральній машині.
          Випрану річ розрівняти руками, надавши їй форму. Сушити у
          вертикальному положенні на мотузці або вішалці в затінку.
        </p>
        <h5 className="mt-4">Видалення плям</h5>
        <p>
          Перед пранням необхідно обробити пляму милом maestro "для прання
          універсальне", або плямовивідник frosch "засіб для попередньої обробки
          плям". Важливо: не можна допускати висихання мила/плямовивідника на
          тканині. Залишати засіб не більше ніж на 10 хвилин. За необхідності
          змити теплою водою і провести процедуру повторно. Далі, для машинного
          прання використовуємо рідкий засіб або порошок.
        </p>
        <h5 className="mt-4">Прасування</h5>
        <p>Хочете – прасуйте</p>
        </Container>
        </div>
    </main>
  );
};

export default Care;
